Data Frames

Creating Dataframes

import numpy as np
import pandas as pd

import numpy as np
import pandas as pd

## ]-UYTdata = {
    'Name': ['Tauseef', 'Ali', 'Zara'],
    'Age': [22, 24, 21],
    'City': ['Delhi', 'Mumbai', 'Lucknow'],
    'Slary': ['65000' , '75000' ,  '83000']
}

df = pd.DataFrame(data)

In [26]:
df

      Name  Age     City  Slary
0  Tauseef   22    Delhi  65000
1      Ali   24   Mumbai  75000
2     Zara   21  Lucknow  83000

USING LIST

In [9]:

data = [
    ['Tauseef', 22, 'Delhi'],
    ['Ali', 24, 'Mumbai'],
    ['Zara', 21, 'Lucknow']
]

df2 = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df2)

      Name  Age     City
0  Tauseef   22    Delhi
1      Ali   24   Mumbai
2     Zara   21  Lucknow

FROM LIST OF DICTIONARIES

In [11]:
data = [
    {'Name': 'Tauseef', 'Age': 22, 'City': 'Delhi'},
    {'Name': 'Ali', 'Age': 24, 'City': 'Mumbai'},
    {'Name': 'Zara', 'Age': 21, 'City': 'Lucknow'}
]

df3 = pd.DataFrame(data)
print(df3)

      Name  Age     City
0  Tauseef   22    Delhi
1      Ali   24   Mumbai
2     Zara   21  Lucknow

From NumPy Arrays

In [12]:
import numpy as np

arr = np.array([
    ['Tauseef', 22, 'Delhi'],
    ['Ali', 24, 'Mumbai']
])

df4 = pd.DataFrame(arr, columns=['Name', 'Age', 'City'])
print(df4)

      Name Age    City
0  Tauseef  22   Delhi
1      Ali  24  Mumbai

In [23]:
df[['Name']]

      Name
0  Tauseef
1      Ali
2     Zara

In [21]:
df4[['City' , 'Age']]

     City Age
0   Delhi  22
1  Mumbai  24